# Списки
	# Список - это набор элементов, следующих в определенном порядке. В список можно поместить любые данные, при том, что они даже не будут между собой связаны

# 1. Синтаксис списка
result = ['one', 'two', 'three', 'four', 'five', 'six', 'seven'];
print(result);

# 2. Обращение к элементам списка
	# Индексы начинаются с 0, а не с 1
	# Чтобы обратиться к определенному элементу в списке, нужно укзаать его индекс

print(result[2]);

# 3. Обращение к последнему элементу списка
print(result[-1]);